tap "felixkratz/formulae"
tap "nikitabobko/tap"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Object-relational database system
brew "postgresql@18", restart_service: :changed, link: true
# Terminal multiplexer
brew "tmux"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# Application uninstaller
cask "appcleaner"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Voice and text chat software
cask "discord"
# Window peeking utility app
cask "dockdoor"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-monaspice-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Chromium-based web browser
cask "helium-browser"
# Utility to hide menu bar items
cask "hiddenbar"
# Hides the Dock when it is overlapped by a window
cask "intellidock"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Music streaming service
cask "spotify"
# Custom Discord App
cask "vesktop"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
vscode "entuent.fira-code-nerd-font"
vscode "github.copilot-chat"
vscode "karyfoundation.theme-karyfoundation-themes"
vscode "ritwickdey.liveserver"
vscode "vscodevim.vim"
vscode "webhooked.kanso-theme"
npm "live-server"
npm "nodemon"
npm "tree-sitter-cli"
