brew "bpytop"
brew "coreutils"
brew "fd"
brew "fontconfig"
brew "git"
brew "neovim"
brew "node"
brew "ripgrep"
brew "rustup"
brew "tmux"
cask "aldente"
cask "appcleaner"
cask "copilot-cli"
cask "dockdoor"
cask "firefox@nightly"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "hiddenbar"
cask "intellidock"
cask "iterm2"
cask "rar"
cask "rectangle"
cask "sf-symbols"
cask "spotify"
cask "vesktop"
